SELECT *
FROM VIEW_PROF_INFO;
/*
교수이름   배정과목             과목시작일 과목종료일 교재명               강의실               강의진행
---------- -------------------- ---------- ---------- -------------------- -------------------- ----
PRO001     JAVA                 2022-09-10 2023-01-01 Java의 정석          A강의장              강의예정
*/


SELECT *
FROM VIEW_STD_INFO;

SELECT *
FROM VIEW_SUB_INFO;
/*
과정명                         강의실명   과목명   과목시작일   과목종료일   교재명        교수이름      
------------------------------ ---------- -------- ------------ ------------ ------------- ----------
AWS 클라우드 개발자 양성과정   A강의장    JAVA     2022-09-10   2023-01-01   Java의 정석   김호진    
*/